# <font color='red'>Combining Datasets: Concat and Append

## Recall: Concatenation of NumPy Arrays

In [1]:
import pandas as pd

In [2]:
x = [1,2,3]

In [3]:
y = [4,5,6]

In [4]:
z = [7,8,9]

In [5]:
import numpy as np

In [6]:
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [7]:
# axis

In [8]:
x = [[1,2,3,4]]

In [9]:
np.concatenate([x,x], axis = 1)

array([[1, 2, 3, 4, 1, 2, 3, 4]])

## Simple Concatenation with pd.concat

In [10]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])

In [11]:
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [12]:
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [15]:
x = [1,2,3]

In [16]:
y = [4,5,6]

In [17]:
df1 = pd.DataFrame(x, index=['a','b','c'])

In [18]:
df2 = pd.DataFrame(y, index=['d','e','f'])

In [19]:
df1

   0
a  1
b  2
c  3

In [20]:
df2

   0
d  4
e  5
f  6

In [21]:
pd.concat([df1,df2]) # default it is row wise concat

   0
a  1
b  2
c  3
d  4
e  5
f  6

In [23]:
pd.concat([df1,df2], axis = 'columns')

     0    0
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  4.0
e  NaN  5.0
f  NaN  6.0

In [24]:
pd.concat([df1,df2], axis = 'rows')

   0
a  1
b  2
c  3
d  4
e  5
f  6

In [25]:
# Concatenation with joins

In [36]:
df5 = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns = ['a','b','c'])

In [37]:
df5

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
df6 = pd.DataFrame(np.array([[10,11,12],[13,14,15],[16,17,18]]), columns = ['b','c','d'])

In [39]:
df6

    b   c   d
0  10  11  12
1  13  14  15
2  16  17  18

In [40]:
pd.concat([df5,df6])

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  7.0   8   9   NaN
0  NaN  10  11  12.0
1  NaN  13  14  15.0
2  NaN  16  17  18.0

In [42]:
pd.concat([df5,df6], join = 'outer') # union

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  7.0   8   9   NaN
0  NaN  10  11  12.0
1  NaN  13  14  15.0
2  NaN  16  17  18.0

In [43]:
pd.concat([df5,df6], join = 'inner') # intersection

    b   c
0   2   3
1   5   6
2   8   9
0  10  11
1  13  14
2  16  17

## The append() method

In [45]:
df5

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [46]:
df6

    b   c   d
0  10  11  12
1  13  14  15
2  16  17  18

In [47]:
df5.append(df6)

C:\Users\91701\AppData\Local\Temp\ipykernel_12904\551904218.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df5.append(df6)

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  7.0   8   9   NaN
0  NaN  10  11  12.0
1  NaN  13  14  15.0
2  NaN  16  17  18.0